backend/research/n3/wrk_multi_friends.txt
Running 10s test @ http://localhost:8080/v1/friends
  8 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.35ms    8.32ms  74.82ms   65.96%
    Req/Sec     1.07k   305.09     1.64k    53.12%
  Latency Distribution
     50%   20.27ms
     75%   31.07ms
     90%   36.70ms
     99%   40.90ms
  85690 requests in 10.03s, 83.19MB read
Requests/sec:   8543.87
Transfer/sec:      8.29MB